results/results_m5_large/results_m5_large_run2/oltp_read_write_t8/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 44.39 qps: 894.72 (r/w/o: 627.38/51.39/215.96) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 41.00 qps: 821.12 (r/w/o: 575.32/47.40/198.41) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 41.50 qps: 829.40 (r/w/o: 580.40/50.30/198.70) lat (ms,95%): 337.94 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 45.80 qps: 915.20 (r/w/o: 640.40/54.40/220.40) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 45.80 qps: 919.50 (r/w/o: 644.60/54.10/220.80) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 41.70 qps: 833.10 (r/w/o: 582.80/51.10/199.20) lat (ms,95%): 350.33 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 46.20 qps: 925.20 (r/w/o: 647.80/55.60/221.80) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 47.90 qps: 953.20 (r/w/o: 666.00/56.60/230.60) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 40.70 qps: 817.20 (r/w/o: 572.40/49.70/195.10) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 40.20 qps: 803.40 (r/w/o: 562.60/48.80/192.00) lat (ms,95%): 419.45 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 42.40 qps: 848.40 (r/w/o: 593.90/50.60/203.90) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 37.00 qps: 743.90 (r/w/o: 521.00/45.60/177.30) lat (ms,95%): 493.24 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            72156
        write:                           6166
        other:                           24758
        total:                           103080
    transactions:                        5154   (42.93 per sec.)
    queries:                             103080 (858.57 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      42.9283
    time elapsed:                        120.0606s
    total number of events:              5154

Latency (ms):
         min:                                   88.11
         avg:                                  186.31
         max:                                  849.36
         95th percentile:                      308.84
         sum:                               960220.87

Threads fairness:
    events (avg/stddev):           644.2500/5.21
    execution time (avg/stddev):   120.0276/0.02